# Combining Datasets: Concat and Append

In [1]:
import numpy as np
import pandas as pd

In [9]:
#Â pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
#          keys=None, levels=None, names=None, verify_integrity=False,
#          copy=True)

In [2]:
def make_df(cols, ind):
    '''
    Quickly make a DataFrame
    '''
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [3]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])

pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [8]:
df1 = make_df('AB', [1,2])
df2 = make_df('AB', [3,4])

pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [12]:
df3 = make_df('AB', [1,2])
df4 = make_df('AB', [6,7])

pd.concat([df3, df4], ignore_index = True)

    A   B
0  A1  B1
1  A2  B2
2  A6  B6
3  A7  B7

In [19]:
df5 = make_df('ABC', [1,2])
df6 = make_df('BCE', [6,7,8])

pd.concat([df5, df6], 
          ignore_index = True,
          join = 'inner')

    B   C
0  B1  C1
1  B2  C2
2  B6  C6
3  B7  C7
4  B8  C8

In [21]:
df7 = make_df('ABC', [1,2])
df8 = make_df('BCE', [6,7,8])

df7.append(df8)

     A   B   C    E
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
6  NaN  B6  C6   E6
7  NaN  B7  C7   E7
8  NaN  B8  C8   E8